{
  "words": [
    {
      "id": 1,
      "word": "motivated",
      "definition": "feeling enthusiastic or determined to achieve something",
      "examples": [
        "I feel motivated after watching that inspirational movie.",
        "He stayed motivated during tough times.",
        "A motivated person can achieve anything they dream of."
      ]
    },
    {
      "id": 2,
      "word": "determined",
      "definition": "having made a firm decision and being resolved not to change it",
      "examples": [
        "She was determined to win the competition.",
        "Despite failures, he remained determined to succeed.",
        "A determined mind can overcome any obstacle."
      ]
    },
    {
      "id": 3,
      "word": "victory",
      "definition": "an act of defeating an enemy or opponent",
      "examples": [
        "The team celebrated their victory with great joy.",
        "Victory often comes after many failures.",
        "His first victory was a turning point in his career."
      ]
    },
    {
      "id": 4,
      "word": "legacy",
      "definition": "something that is left behind by someone after they are gone",
      "examples": [
        "Maharana Pratap left behind a powerful legacy.",
        "The legacy of great leaders inspires generations.",
        "She wants to leave a positive legacy through her work."
      ]
    },
    {
      "id": 5,
      "word": "admirable",
      "definition": "deserving respect and approval",
      "examples": [
        "His bravery in the battle was admirable.",
        "Helping others is an admirable quality.",
        "She did an admirable job leading the project."
      ]
    },
    {
      "id": 6,
      "word": "courage",
      "definition": "the ability to do something that frightens one",
      "examples": [
        "It takes courage to speak the truth.",
        "He showed great courage in facing the challenges.",
        "Courage is the first step toward success."
      ]
    },
    {
      "id": 7,
      "word": "journey",
      "definition": "an act of traveling from one place to another; a process of learning or growing",
      "examples": [
        "Life is a beautiful journey full of surprises.",
        "Their journey across the desert was difficult but memorable.",
        "Success is not a destination, it’s a journey."
      ]
    },
     {
      "id": 8,
      "word": "motivation",
      "definition": "the reason or reasons one has for acting or behaving in a particular way",
      "examples": [
        "Watching 3 Idiots gives me a lot of motivation.",
        "Motivation helps people keep moving even in hard times.",
        "He found motivation in his dream to become a doctor."
      ]
    },
    {
      "id": 9,
      "word": "perspective",
      "definition": "a particular way of thinking about something",
      "examples": [
        "Watching realistic movies gives me a new perspective on life.",
        "Traveling can broaden your perspective.",
        "It's important to see things from another person's perspective."
      ]
    },
    {
      "id": 10,
      "word": "impact",
      "definition": "a strong effect or influence",
      "examples": [
        "The movie had a huge impact on me.",
        "Her speech made a great impact on the audience.",
        "Good books can leave a lasting impact on your thinking."
      ]
    }
  ]
}
